<?php
defined('BASEPATH') OR exit('No direct script access allowed');

class Main extends CI_Controller {

    private $competitives = array (
        'Комп`ютерні системи та мережі' => array(
            'Програмне та технічне забезпечення КСМ',
            'Архітектура КСМ',
            'Паралельні обчислення',
            'Квантові комп`ютери',
            'Процесори нечіткої математики та логіки',
            'Процесори на базі нейромереж',
            'Трафік КСМ',
            'Виявлення аномальних станів трафіка, самоподібний трафік',
            'Алгоритми стиснення даних на підставі фрактальної математики'
        ),
        'Безпека інформаційних та телекомунікаційних систем' => array(
            'Проблеми адміністрування та їх роль в організації безпеки',
            'Антивірусні засоби',
            'Криптографія, нові алгоритми, принципи',
            'Антихакінг',
            'Захист від несанкціонованого доступу'
        ),
        'Інформаційні системи, бази даних та системи штучного інтелекту' => array(
            'Організація пошуку у БД за умов погано визначених запитів',
            'Алгоритми пошуку у розподілених БД',
            'Надвеликі БД, нові алгоритми та технології обробки даних',
            'Нові алгоритми і методи витягнення знань з БД',
            'Розв`язок прикладних задач на підставі методів та моделей штучного інтелекту (використання Нечіткої математики та логіки, нейромережі, генетичні алгоритми  та еволюційне програмування)',
            'Нові алгоритми розпізнавання образів',
            'Нові способи організації БЗ'
        ),
        'Технології програмування (прикладне та системне програмування)' => array(
            'Програми спеціального призначення (автоматизація наукових досліджень, моніторинг операційних середовищ, комп`ютерна вірусологія)',
            'Програми розв`язку обчислювальних задач, орієнтованих на різні галузі народного господарства',
            'Системне програмування на рівні .dll-програм, захист та адміністрування  бібліотек .dll-програм',
            'Створення інтерфейсів для одночасної роботи різних середовищ (MatLab & C++, MatLab & MathCad, MatLab &HTML і т.ін.)',
        ),
        'Мультимедійні системи, навчальні та ігрові програми' => array(
            'Анімаційні моделі явищ (хімічні реакції, фізичні досліди, робота окремих видів техніки та її вузлів)',
            'Навчальні програми для полегшення вивчення окремих розділів шкільних предметів',
            'Контролюючі програми',
            'Програми для розв`язку головоломок',
            'Ігрові програми  для молодших школярів з навчальним підтекстом (наприклад, гра  у „15”, „хрестики-нолики”, шахи з поясненням окремих ходів і забороною невірних)',
            'Електронні розв`язники задач (наприклад, розв’язування задач із підручника Сканаві або ін. авторів)',
            'Розділи електронних підручників шкільних дисциплін'
        ),
        'Інтернет-технології та WEB-дизайн' => array(
            'Розробка та супровід WEB-сайтів школи, класу',
            'Розробка алгоритмів обмеження доступу на сайти',
            'Розробка алгоритмів швидкого пошуку інформації у довідкових системах (Google, Rambler, Yahoo та ін.)',
            'Електронна комерція',
            'Розробка окремих сервісів для поштових серверів'
        ),
    );

    public function index(){
        /*
         * Main page
         * url "/"
         * @array $data['status_list'] -> view
         */
        $this->load->model('Status_model');
        $this->data['status_list'] = $this->Status_model->getStatusList();
        $this->data['competitives'] = $this->competitives;


        $this->load->view('header');
        $this->load->view('main/main', $this->data);
        $this->load->view('footer');
    }

    public function about(){
        /*
         * About MAN page
         * url "/about"
         * @array $data['status_list'] -> view
         */

        $this->load->model('Status_model');
        $this->data['status_list'] = $this->Status_model->getStatusList();

        $this->data['competitives'] = $this->competitives;


//        $this->load->view('layouts/header');
//        $this->load->view('about/about', $this->data);
//        $this->load->view('layouts/footer');
    }
}