<section>
    <div class="news-item">
        <header>
            <img src="/front-core/images/slider/slide-1.jpg">
        </header>
        <article>
            <header>
                <h2>Вебінари з іспанської мови</h2>
            </header>
            <p>
                Протягом листопада – грудня Національний центр «Мала академія наук України» пропонує
                навчальним закладам організацію безкоштовних вебінарів з іспанської мови. Першими такою
                можливістю скористалися учні 8–10-х класів НВК «ЗНЗ І–ІІІ ступенів № 9 – спеціалізована школа»
                м. Олександрії Кіровоградської області, вчителі НВК «Нововолинська спеціалізована школа І–ІІІ ст. –
                колегіум» і спеціалізованої школи № 64 м. Києва. Відбулися вебінари 30 листопада, провели їх
                викладачі КНУ імені Тараса Шевченка.
            </p>
            <footer>
                <ul>
                    <li>Категория:</li>
                    <li>Залишилось місць:</li>
                    <li>Дата та час проводження:</li>
                </ul>
                <div class="sign-up-event">Записатись</div>
            </footer>
        </article>
    </div>
    <div class="news-item">
        <header>
            <img src="/front-core/images/slider/slide-1.jpg">
        </header>
        <article>
            <header>
                <h2>Вебінари з іспанської мови</h2>
            </header>
            <p>
                Протягом листопада – грудня Національний центр «Мала академія наук України» пропонує
                навчальним закладам організацію безкоштовних вебінарів з іспанської мови. Першими такою
                можливістю скористалися учні 8–10-х класів НВК «ЗНЗ І–ІІІ ступенів № 9 – спеціалізована школа»
                м. Олександрії Кіровоградської області, вчителі НВК «Нововолинська спеціалізована школа І–ІІІ ст. –
                колегіум» і спеціалізованої школи № 64 м. Києва. Відбулися вебінари 30 листопада, провели їх
                викладачі КНУ імені Тараса Шевченка.
            </p>
            <footer>
                <ul>
                    <li>Категория:</li>
                    <li>Залишилось місць:</li>
                    <li>Дата та час проводження:</li>
                </ul>
                <div class="sign-up-event">Записатись</div>
            </footer>
        </article>
    </div>
</section>
